---
kind: method
id: M:Autodesk.Revit.DB.DoubleArrayIterator.#ctor
source: html/5b9d7c92-9468-9b47-3340-0e850fae2e23.htm
---
# Autodesk.Revit.DB.DoubleArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public DoubleArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.